# 4.	Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# o	45 -> 101101
# o	3 -> 11
# o	2 -> 10

# n = 3
# result = ''
# while n > 0:
#     result = str(n % 2) + result
#     n//2
# print(result)

n=11
print(bin(n))
